> x = cons(1, 2).

>>> 1 new errors. Type `sol` for details.

> sol

Solution empty.

Errors
======
Uninitialized rules
===================
Failed to initialize rule:
    x = cons(1, 2).
  due to `Malformed list`
    x = &cons(1, 2).


> retract_rule 0

>>> 1 errors cleared.

> s set= Y for Y in [3,2,1,[2,1],&f(1)].

Changes
=======
s = [1, 2, 3, [2, 1], f(1)].

> foo = 1 in s.

Changes
=======
foo = true.

% check comparison (sort order) of list and non-list.
> f(s). f(1). f([]).

Changes
=======
f(1) = true.
f([1, 2, 3, [2, 1], f(1)]) = true.
f([]) = true.

% test for empty list
> query 1 in nil

1 in nil = false.

> nothing set= X for X in [].




> g([1,2]).

Changes
=======
g([1, 2]) = true.

> a := [1,2].

Changes
=======
a = [1, 2].

> goal(X) := g([1|X]).

Changes
=======
goal([2]) = true.


% list contains
> b := &f("a") in [1,2,&f("a"),3].
| c := 2 in [1,2,3].
| d := 4 in [1,2,3].

Changes
=======
b = true.
c = true.
d = false.


% iteration of a complex list
> things set= X for X in [1,[2,2],[3,4]].

Changes
=======
things = [1, [2, 2], [3, 4]].

% unpack structure requiring a check
> d(&X) := true for [X,X] in [1,[2,2],[3,4],[4,4]].

Changes
=======
d(2) = true.
d(4) = true.


% let's look at a the difference between Booleans and integers
> bar("int") = 1.
| bar("bool") = true.
| bar("two") = 2.

Changes
=======
bar("bool") = true.
bar("int") = 1.
bar("two") = 2.

% quote is important! or else we enumerate everything!
> foo(A) := true for &bar(A) in [1,2,&bar("a"),3].

Changes
=======
foo("a") = true.

% if you don't quote bar(A) drives the querym checking membership in the list.
> goo(A) := true for bar(A) in [true,2,&bar("a")].

Changes
=======
goo("bool") = true.
goo("two") = true.


% unfortunately 1 == true and 0 == false in python so the following is true
> testbool := true in [1,2].

Changes
=======
testbool = false.


% fun with set= at bag=
> thingsbag bag= "three".
| thingsbag bag= 1.
| thingsbag bag= 1.
| thingsbag bag= 2.
| thingsbag bag= true.
|
| thingset set= "three".
| thingset set= 1.
| thingset set= 1.
| thingset set= true.
| thingset set= 2.

Changes
=======
thingsbag = [true, 1, 1, 2, "three"].
thingset = [true, 1, 2, "three"].


% comparison operator
> foobar([]).
| foobar([1,2]).
| foobar([1,3]).
| foobar("a").
| foobar(&a, &b).
| foobar(&a, &c).

Changes
=======
foobar("a") = true.
foobar([1, 2]) = true.
foobar([1, 3]) = true.
foobar([]) = true.
foobar(a,b) = true.
foobar(a,c) = true.



%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% Errors

> xxx = 1 for X in 1234.

>>> 1 new errors. Type `sol` for details.

> xxx = 1 in 1234.

>>> 1 new errors. Type `sol` for details.
